#（GROB数据库没GROB主轴零部件信息，以及所有拉紧弹簧信息）
#（GROB数据库没收录能源胶管）
#(GROB数据库无润滑过滤滤芯）
#（grob数据库没收录高压泵）
#主轴类
# sp     代表主轴整体
# sp1    代表主轴旋转接头
# sp2    代表主轴夹头
# sp3    代表主轴夹头密封
# sp4    代表主轴振动检测传感器
# sp5    代表主轴拉紧弹簧
# 2476378是带振动检测的HSK100的kessler的主轴集成，核心是2409274 Kessler的13241.06; DMS112.56.8.FOS
# 2100138是GROB的HSK63的主轴集成，MSP63150-042-01-01和密封环，但没有子装配图
# 2553698是集成扭矩支撑架和振动传感器的HSK100的主轴集成，核心是2409274 kessler的13241.06; DMS112.56.8.FOS
# 2709286是GROB HSK63的主轴集成MSP63150-042-001-021和一个评估装置，但没有子装配图
sp=dict.fromkeys(['2476378','2100138','2553698','2709286'],'M')

replace1_sp={'sp':0,'sp1':1,'sp2':0,'sp3':1,'sp4':0,'sp5':0}
reserve1_sp={'sp':0.05,'sp1':0,'sp2':0.05,'sp3':0,'sp4':0,'sp5':0.1}
name_sp=['motorized spindle HBG']


#AB轴转台类
# rtb    代表B轴转台整体及更换整体时所需附件
# rta    代表A轴转台整体及更换整体时所需附件
# rt1    代表转台圆光栅及更换时所需附件或编码器
# rt2    代表转台旋转密封
# rt3    代表转台旋转分配器芯轴
# rt4    代表转台主轴承
# rt5    代表转台刹车部件
# rt6    代表A轴转台机械驱动及附件
# rt7    代表转台台面外侧密封件
# rt8    代表A轴接头密封
# rt9    代表A轴驱动电机,变速器及联轴器
# ！2384928是G525B轴的B轴转台整体
# ！2380274是G515B轴的B轴转台整体
# !2518531是G525AB轴和G515AB轴和G315AB的B轴转台整体
#！2072982和2092587分别是G525AB的A轴两侧转台整体
# ！2063831和2064992分别是G325A的A轴两侧转台整体
# ！2452181是G515AB A轴整体
# !2593735是G515AB A轴整体2(编码器测量，无分配器)
# ！2452165是G515A A轴整体（圆光栅，有分配器）
# ！2593678是G515A A轴整体2（编码器测量，无分配器）
# !2593781是G315A A轴整体
# ！2593834是G315AB A轴整体
## 2384961是G525B桥板
## 2530246是G525AB桥板(无整体更换详图)
## 2719696是G515AB的桥板
## 2587390是G315AB的桥板
## 2695781是G515ABS的桥板
rt=dict.fromkeys(['2384961','2530246','2719696','2587390','2695781'],'M')#M是后续处理符号，根据零件号，直接读取对应表格批量导入零件
replace1_rt={'rtb':0,'rta':0,'rt1':0,'rt2':0,'rt3':0,'rt4':0,'rt5':0,'rt6':0,'rt7':0,'rt8':0,'rt9':0}
reserve1_rt={'rtb':0.05,'rta':0.05,'rt1':0,'rt2':0.1,'rt3':0,'rt4':0,'rt5':0,'rt6':0,'rt7':0,'rt8':0,'rt9':0}
name_rt=['bridge HBG']
# X轴类
# x1    代表X轴丝杠及更换时所需附件
# x2    代表X轴导轨滑块
# x3    代表X轴护罩拉罩
# x4    代表X轴电机、变速器及联轴器
# x5    代表X轴滑块刮板
# x6    代表X轴测量系统
#2462753是G525B X轴底座集成
#！2708599是G515B X轴底座集成
#！2708606是G515AB X轴底座集成
#！2708550是G515A X轴底座集成
#！2600041是G515A X轴底座集成2(搭载转台不同)
#!2708695是G315A x轴底座集成
#！2708718是G315AB x轴集成
#2333124是G325A X轴底座集成
#!2708673是G515ABS 的X轴底座集成
x=dict.fromkeys(['2462753','2708599','2708606','2708550','2600041','2708695','2708718','2333124','2708673'],'M')#M是后续处理符号，根据零件号，直接读取对应表格批量导入零件
#1409887和2021731是G525、G325和G315机床X拉罩
#1344485和1344486是G515机床X拉罩
x3=dict.fromkeys(['1409887','2021731','1344485','1344486'],'x3')
replace1_x={'x1':0,'x2':0,'x3':0,'x4':0,'x5':0,'x6':0}
reserve1_x={'x1':0.1,'x2':0.05,'x3':0.2,'x4':0,'x5':0.2,'x6':0}
name_x=['guideway bed HBG']
# Y轴类
# y1    代表Y轴丝杠及更换时所需附件
# y2    代表Y轴导轨滑块
# y3    代表Y轴平衡油缸及更换时所需附件
# y4    代表Y轴护罩拉罩
# y5    代表Y轴电机、变速器及联轴器
# y6    代表Y轴刹车
# y7    代表Y轴滑块刮板
# y8    代表Y轴测量系统
# y9    代表Y轴驱动皮带
# y10   代表Y轴驱动皮带轮及附件
# ！2607403是G525AB的立柱集成
# 2386043是G525B的立柱集成
# ！2618916是G325A的立柱集成
y=dict.fromkeys(['2607403','2386043','2618916'],'M') #M是后续处理符号，根据零件号，直接读取对应表格批量导入零件
replace1_y={'y1':0,'y2':0,'y3':0,'y4':0,'y5':0,'y6':0,'y7':0,'y8':0,'y9':0,'y10':0}
reserve1_y={'y1':0.2,'y2':0.05,'y3':0.1,'y4':0.01,'y5':0,'y6':0,'y7':0.1,'y8':0,'y9':0.1,'y10':0.05}
name_y=['pillar HBG']
# Z轴类
# z1    代表Z轴丝杠及更换时所需附件
# z2    代表Z轴导轨滑块,ZM导轨滑块
# z3    代表Z轴电机、变速器及联轴器
# z4    代表Z轴滑块刮板,ZM罩壳刮板
# z5    代表Z轴测量系统
# z6    代表ZM轴电机，变速器
# z7    代表ZM轴驱动皮带
# z8    代表ZM轴驱动带轮及附件
# z9    代表ZM轴导轨滑块刮板
# 2709396是G525B HSK100的Z轴集成
# 2709397是G525B HSK63的Z轴集成
# 2709367是G515B HSK100的z轴集成
# 2708630是G315 HSK63的z轴集成
# 2633188是G325A HSK63的Z轴集成
# 2721540是G515AB HSK63的Z轴集成
z=dict.fromkeys(['2709396','2709397','2709367','2708630','2633188','2721540'],'M') #M是后续处理符号，根据零件号，直接读取对应表格批量导入零件
replace1_z={'z1':0,'z2':0,'z3':0,'z4':0,'z5':0,'z6':0,'z7':1,'z8':0,'z9':0}
reserve1_z={'z1':0.1,'z2':0.1,'z3':0,'z4':0.3,'z5':0,'z6':0,'z7':0,'z8':0,'z9':0.2}
name_z=['cross slide HBG']
# 能源管路类（GROB数据库没收录能源胶管）
# p1    代表后仓坦克链
# p2    代表前仓坦克链
# p3    代表料仓坦克链
# p4    代表换刀手抓及手动装刀坦克链
# p5    代表能源胶管
#2100437是G525，G515,G325,G315每个z轴水平的坦克链
#2100440是G525 后仓z轴前后坦克链
#2460774是G515后仓坦克链
#2100439是G315,G325后仓z轴前后坦克链
p1=dict.fromkeys(['2100437','2100440','2460774','2100439'],'p1')
#2159818、（2159819，2076521）分别是G525B和G525AB前仓坦克链
#2444613是G515AB A带分配器的前仓旋转坦克链
#2000225是G515B前仓坦克链
#2209820和2090223是G315A 不带分配器的前仓坦克链
#2085966和2159819是G325A不带分配器的前仓坦克链
#2220210和2090223是G515A 不带分配器的前仓坦克链
p2=dict.fromkeys(['2159818','2159819','2076521','2000225','2444613','2209820','2090223','2085966','2159819','2220210'],'p2')
#2440171是G525和G315 料仓坦克链
p3=dict.fromkeys(['2440171'],'p3')
replace1_p={'p1':0,'p2':0,'p3':0,'p4':0,'p5':0}
reserve1_p={'p1':0,'p2':0,'p3':0,'p4':0,'p5':0}
name_p=['cable chain']
# 上料仓类
# l1    代表料仓平移，前移驱动皮带
# l2    代表料仓前移增程皮带
# l3    代表料仓平移，前移导轨滑块，导条，导轮
# l4    代表料仓平移润滑齿轮
# l5    代表料仓平移齿轮齿条
# l6    代表料仓前移丝杠及轴承
# l7    代表料仓平移前移驱动电机，变速器
# l8    代表料仓带轮及附件
# l9    代表料仓料叉压紧弹簧
#2604363是G525上料仓基座
#2606162是G325上料仓基座
#2607033是G515和G315上料仓基座
#2457810是G525、G515、G325、G315前后滑台
#2356240和2356220分别是（G525、G325、G315）的前后和左右驱动
l=dict.fromkeys(['2604363','2607033','2457810','2356240','2356220','2606162'],'M') #M是后续处理符号，根据零件号，直接读取对应表格批量导入零件
#1000021104和1146567是托盘平移导轮
l3=dict.fromkeys(['1000021104','1146567'],'l3')
replace1_l={'l1':1,'l2':1,'l3':0,'l4':1,'l5':0,'l6':0,'l7':0,'l8':0,'l9':0}
reserve1_l={'l1':0,'l2':0,'l3':0.05,'l4':0,'l5':0,'l6':0.05,'l7':0,'l8':0,'l9':0}
# 上料门类
# d1    代表上料门皮带
# d2    代表上料门传感器
# d3    代表上料门电机及变速器，联轴器
# d4    代表上料门导轨滑块
# d5    代表上料门皮带轮及其轴承
#2257001和2493217是分别G525和G515上料门
#2422430是G315上料门
#2251325是G325上料门
d=dict.fromkeys(['2257001','2493217','2422430','2251325'],'M') #M是后续处理符号，根据零件号，直接读取对应表格批量导入零件
replace1_d={'d1':0,'d2':0,'d3':0,'d4':0,'d5':0}
reserve1_d={'d1':0,'d2':0,'d3':0,'d4':0,'d5':0}
name_d=['traverse HBG']
#刀库类
#t1     代表刀库刀夹
#t2     代表刀库刀刷
#t3     代表刀库刀盘、换刀手的电机，变速器及联轴器
#t4     代表刀库换刀手抓E轴皮带，旋转分配器密封
#t5     代表刀库内模拟传感器，距离传感器
#t6     代表刀库换刀手齿轮齿条，导轨滑块
#t7     代表刀库换刀手手抓旋转分配器芯轴，带轮，手抓松刀机构密封及相关更换附件
#t8     代表刀库刀刷驱动机构，齿轮，轴承及附件
#t9     代表断刀检测传感器
#t10    代表刀库刀盘松刀气缸
#2711589是G525 HSK100刀库总成
#2711590是G525 HSK63刀库总成
#2711458是G325 HSK63刀库总成
#2711505是G515 HSK100单刀盘总成
#2711507是G315 HSK63单刀盘总成
#2771517是G515 HSK100 18把刀的单刀盘总成
#2711583是G515 HSK63单刀盘总成
t=dict.fromkeys(['2711589','2711590','2711458','2711505','2771517','2711507','2711583'],'M')#M是后续处理符号，根据零件号，直接读取对应表格批量导入零件
replace1_t={'t1':0,'t2':1,'t3':0,'t4':0,'t5':0,'t6':0,'t7':0,'t8':0,'t9':0,'t10':0}
reserve1_t={'t1':0.01,'t2':0,'t3':0.05,'t4':0,'t5':0.05,'t6':0.03,'t7':0,'t8':0,'t9':0.05,'t10':0}
name_t=['tool magazine HBG']
#手动装刀类
#mt1    代表手动装刀夹刀弹簧
#mt2    代表手动装刀气缸及浮动接头
#mt3    代表手动装刀机构传感器
#mt4    代表手动装刀导轨滑块,连杆衬套
#2644239 是G525 HSK100手动装刀机构总成
#2653951 是G525 HSK63手动装刀机构总成
#2159027 是G325 HSK63手动装刀机构总成
mt=dict.fromkeys(['2644239','2653951','2159027'],'M')#M是后续处理符号，根据零件号，直接读取对应表格批量导入零件
replace1_mt={'mt1':0,'mt2':0,'mt3':0,'mt4':0}
reserve1_mt={'mt1':0.05,'mt2':0,'mt3':0,'mt4':0}
name_mt=['elevator HBG']
#液压类
#h1     代表液压泵及联轴器
#h2     代表蓄能器皮囊
#h3     代表液压系统滤芯，呼吸口
#h4     代表液压回油过滤器整体
#h5     代表液压电机
#h6     代表流量计
#1209618是油箱回油过滤器
#1084348是G525油箱蓄能器
#157681是G525平衡油缸蓄能器
h=dict.fromkeys(['1209618','1084348','157681'],'F')#F是后续处理符号，根据零件号，直接读取对应表格批量导入零件
#968030代表G525液压泵
#919688代表G525液压泵联轴器
h1=dict.fromkeys(['968030','919688'],'h1')
#9122393代表G525油箱呼吸口
h3=dict.fromkeys(['122393'],'h3')
#2265158是G525液压站电机
h5=dict.fromkeys(['2265158'],'h5')
#1585595和1109185分别是0.1和0.04分辨率流量计
h6=dict.fromkeys(['1585595','1109185'],'h6')
replace1_h={'h1':0,'h2':0,'h3':1,'h4':0,'h5':0,'h6':0}
reserve1_h={'h1':0,'h2':0.05,'h3':0,'h4':0.05,'h5':0,'h6':0.1}
#气动类
#pn1     代表过滤滤芯类
#pn2     代表消音器类
#154681和966270分别是粗精过滤减压阀
pn=dict.fromkeys(['154681','966270'],'F')#F是后续处理符号，根据零件号，直接读取对应表格批量导入零件
pn2=dict.fromkeys(['152644','152648','152654','152644'],'pn2')
replace1_pn={'pn1':1,'pn2':0}
reserve1_pn={'pn1':0,'pn2':0}
#切削液类（grob数据库没收录高压泵）
#c1     代表切削液系统滤芯
#c2     代表切削液高压冷却过滤器
#c3     代表切削液高压泵
#c4     代表切削液高压溢流阀
#c5     代表切削液高压电机
#2392261是G525高压冷却液过滤器
c=dict.fromkeys(['2392261'],'F')#F是后续处理符号，根据零件号，直接读取对应表格批量导入零件
#1120325
c4=dict.fromkeys(['1120325'],'c4')
replace1_c={'c1':1,'c2':0,'c3':0,'c4':0,'c5':0}
reserve1_c={'c1':0,'c2':0,'c3':0,'c4':0.05,'c5':0}
#润滑类（GROB数据库无过滤滤芯）
#lb1    代表润滑滤芯，呼吸口
#lb2    代表润滑过滤器
#lb3    代表润滑泵
#2546072是润滑油泵
lb3=dict.fromkeys(['2546072'],'lb3')
replace1_lb={'lb1':1,'lb2':0,'lb3':0}
reserve1_lb={'lb1':0,'lb2':0,'lb3':0}

part_type={**sp,**rt,**x,**x3,**y,**z,**p1,**p2,**p3,**l,**l3,**d,**t,**mt,**h,**h1,**h3,**h5,**h6,**pn,**pn2,**c,**c4,**lb3}
rp1={**replace1_sp,**replace1_rt,**replace1_x,**replace1_y,**replace1_z,**replace1_p,**replace1_l,**replace1_d,**replace1_t,**replace1_mt,**replace1_h,**replace1_pn,**replace1_c,**replace1_lb}
rs1={**reserve1_sp,**reserve1_rt,**reserve1_x,**reserve1_y,**reserve1_z,**reserve1_p,**reserve1_l,**reserve1_d,**reserve1_t,**reserve1_mt,**reserve1_h,**reserve1_pn,**reserve1_c,**reserve1_lb}
rate_={'rp1':rp1,'rs1':rs1}
name_=[*name_sp,*name_rt,*name_x,*name_y,*name_z,*name_d,*name_t,*name_mt,]
